app/views/posts/_form.html.erb

<% submit_text = (post.persisted?) ? "Update" : "Create" %>
<% all_subs = Sub.all %> <!-- pre-fetch to avoid N+1 query -->
---
SELECT "subs".* FROM "subs"

        value="<%= sub.id %>"
        <%= checked="checked" if post.sub_ids.include?(sub.id) %>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]