app/controllers/application_controller.rb

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_mod!
    @sub ||= Sub.find_by(id: params[:id])