app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find_by(id: params[:id])

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "yeet"], ["author_id", 1], ["post_id", 1], ["created_at", "2019-08-30 02:31:26.094632"], ["updated_at", "2019-08-30 02:31:26.094632"], ["parent_comment_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save