app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params.merge(author_id: current_user.id))

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "newpost"], ["url", "urlll"], ["content", "content"], ["author_id", 1], ["created_at", "2019-08-29 21:59:32.683482"], ["updated_at", "2019-08-29 21:59:32.683482"]]

  def update
    @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    post = Post.find_by(id: params[:id])
    post.destroy!
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]