app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params.merge(mod_id: current_user.id))

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "newsub"], ["description", "idwidjwijdiwj"], ["mod_id", 2], ["created_at", "2019-08-29 07:21:23.382758"], ["updated_at", "2019-08-29 07:21:23.382758"]]

  def edit
    @sub ||= Sub.find_by(id: params[:id])
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @sub ||= Sub.find_by(id: params[:id])

    if @sub.update(sub_params)
---
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "titlewww"], ["description", "descwdwdwd"], ["updated_at", "2019-08-29 07:38:08.947881"], ["id", 1]]