app/models/post.rb

  def comments_by_parent_id
    comments_hash = Hash.new { |h, k| h[k] = [] }
    self.comments.includes(:author).each { |cmt| comments_hash[cmt.parent_comment_id] << cmt }
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]