app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "lnCzCVOFbEVbbafMpKLDYQ"], ["LIMIT", 1]]
---
  def self.generate_uniq_session_token
    token = SecureRandom::urlsafe_base64(16)
    token = SecureRandom::urlsafe_base64(16) while User.exists?(session_token: token)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GTuwIXmshxK7mKD8aRlYpw"], ["updated_at", "2019-08-30 04:28:24.266318"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = self.class.generate_uniq_session_token
    self.save!